In [2]:
with open('player.json', 'r') as file:
    player_data = json.load(file)

In [80]:
import pandas as pd

player_df = pd.DataFrame(player_data)

In [78]:
player_df[player_df["last_name"] == "wallace"] # nba playmaker

   first_name last_name  birth_date
96    lopatin   wallace  1984-05-10

In [28]:
player_df[player_df["last_name"] == "dibartolomeo"] # euro playmaker

    first_name     last_name  birth_date
242      sikma  dibartolomeo  1989-01-13

In [32]:
player_df[player_df["last_name"] == "hammons"] # nba shooter/3&D

    first_name last_name  birth_date
589     krause   hammons  1987-05-21

In [35]:
player_df[player_df["last_name"] == "parrillo"] # nba shooter/3&D

    first_name last_name  birth_date
697      delia  parrillo  1987-11-18

In [38]:
player_df[player_df["last_name"] == "ofoegbu"] # nba shooter

    first_name last_name  birth_date
531  marcquise   ofoegbu  1988-08-11

In [101]:
player_df[player_df["last_name"] == "sloan"] # nba shooter

     first_name last_name  birth_date
140  carrington     sloan  1992-11-23

In [41]:
player_df[player_df["last_name"] == "forbes"] # euro shooter/playmaker

     first_name last_name  birth_date
1345      conti    forbes  1988-12-17

In [44]:
player_df[player_df["last_name"] == "buycks"] # euro shooter/playmaker

    first_name last_name  birth_date
715       r.j.    buycks  1990-07-14

In [47]:
player_df[player_df["last_name"] == "dime"] # euro full package (guard)

    first_name last_name  birth_date
874    oleksiy      dime  1992-09-27

In [52]:
player_df[player_df["last_name"] == "yildizli"] # nba lockdown

     first_name last_name  birth_date
1276        don  yildizli  1990-09-15

In [55]:
player_df[player_df["last_name"] == "luwawu-cabarrot"] # nba lockdown

    first_name        last_name  birth_date
143    casarin  luwawu-cabarrot  1988-08-13

In [59]:
player_df[player_df["last_name"] == "gerun"] # nba lockdown

     first_name last_name  birth_date
1489   jakeenan     gerun  1985-05-27

In [62]:
player_df[player_df["last_name"] == "ladurner"] # nba defensive big

     first_name last_name  birth_date
1428   sundiata  ladurner  1992-03-13

In [66]:
player_df[player_df["last_name"] == "landers"] # nba defensive big

     first_name last_name  birth_date
1495     bonzie   landers  1987-04-22

In [69]:
player_df[player_df["last_name"] == "burns"] # nba two way big

    first_name last_name  birth_date
690      jamie     burns  1989-10-13

In [72]:
player_df[player_df["last_name"] == "rice"] # nba defensive big (maybe two way)

    first_name last_name  birth_date
575      ahmad      rice  1992-06-10

In [76]:
player_df[player_df["last_name"] == "burns"] # euro defensive big

    first_name last_name  birth_date
690      jamie     burns  1989-10-13

In [84]:
player_df[player_df["last_name"] == "herrmann"] # nba offensive big

     first_name last_name  birth_date
1546       odom  herrmann  1990-10-02

In [87]:
player_df[player_df["last_name"] == "kyser"] # nba offensive big

      first_name last_name  birth_date
1319  viacheslav     kyser  1980-05-09

In [90]:
player_df[player_df["last_name"] == "barnes"] # nba offensive big

    first_name last_name  birth_date
253   ladontae    barnes  1994-06-26

In [93]:
player_df[player_df["last_name"] == "sweetney"] # euro offensive big

    first_name last_name  birth_date
880     maynor  sweetney  1988-11-04

In [96]:
player_df[player_df["last_name"] == "tavares"] # euro offensive big

     first_name last_name  birth_date
954  filipovity   tavares  1992-09-16